In [4]:
import pandas as pd
df = pd.read_csv("city_temperature.csv")

/home/ec2-user/anaconda3/envs/python3/lib/python3.6/site-packages/IPython/core/interactiveshell.py:3063: DtypeWarning: Columns (2) have mixed types.Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

In [7]:
df.head(10)

   Region  Country State     City  Month  Day  Year  AvgTemperature
0  Africa  Algeria   NaN  Algiers      1    1  1995            64.2
1  Africa  Algeria   NaN  Algiers      1    2  1995            49.4
2  Africa  Algeria   NaN  Algiers      1    3  1995            48.8
3  Africa  Algeria   NaN  Algiers      1    4  1995            46.4
4  Africa  Algeria   NaN  Algiers      1    5  1995            47.9
5  Africa  Algeria   NaN  Algiers      1    6  1995            48.7
6  Africa  Algeria   NaN  Algiers      1    7  1995            48.9
7  Africa  Algeria   NaN  Algiers      1    8  1995            49.1
8  Africa  Algeria   NaN  Algiers      1    9  1995            49.0
9  Africa  Algeria   NaN  Algiers      1   10  1995            51.9

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2906327 entries, 0 to 2906326
Data columns (total 8 columns):
 #   Column          Dtype
---  ------          -----
 0   Region          object
 1   Country         object
 2   State           object
 3   City            object
 4   Month           int64
 5   Day             int64
 6   Year            int64
 7   AvgTemperature  float64
dtypes: float64(1), int64(3), object(4)
memory usage: 177.4+ MB

In [6]:
df.describe()

              Month           Day          Year  AvgTemperature
count  2.906327e+06  2.906327e+06  2.906327e+06    2.906327e+06
mean   6.469163e+00  1.571682e+01  2.006624e+03    5.600492e+01
std    3.456489e+00  8.800534e+00  2.338226e+01    3.212359e+01
min    1.000000e+00  0.000000e+00  2.000000e+02   -9.900000e+01
25%    3.000000e+00  8.000000e+00  2.001000e+03    4.580000e+01
50%    6.000000e+00  1.600000e+01  2.007000e+03    6.250000e+01
75%    9.000000e+00  2.300000e+01  2.013000e+03    7.550000e+01
max    1.200000e+01  3.100000e+01  2.020000e+03    1.100000e+02

In [9]:
df.tail(5)

,Region,Country,State,City,Month,Day,Year,AvgTemperature
2906322,North America,US,Additional Territories,San Juan Puerto Rico,7,27,2013,82.4
2906323,North America,US,Additional Territories,San Juan Puerto Rico,7,28,2013,81.6
2906324,North America,US,Additional Territories,San Juan Puerto Rico,7,29,2013,84.2
2906325,North America,US,Additional Territories,San Juan Puerto Rico,7,30,2013,83.8
2906326,North America,US,Additional Territories,San Juan Puerto Rico,7,31,2013,83.6

In [10]:
df.index

RangeIndex(start=0, stop=2906327, step=1)

In [11]:
df.columns

Index(['Region', 'Country', 'State', 'City', 'Month', 'Day', 'Year',
       'AvgTemperature'],
      dtype='object')

In [12]:
df.corr()

                   Month       Day      Year  AvgTemperature
Month           1.000000  0.011209 -0.026898        0.075037
Day             0.011209  1.000000 -0.002213        0.000100
Year           -0.026898 -0.002213  1.000000        0.087245
AvgTemperature  0.075037  0.000100  0.087245        1.000000

In [9]:
df.loc[:, ['Region','AvgTemperature']]

                Region  AvgTemperature
0               Africa            64.2
1               Africa            49.4
2               Africa            48.8
3               Africa            46.4
4               Africa            47.9
...                ...             ...
2906322  North America            82.4
2906323  North America            81.6
2906324  North America            84.2
2906325  North America            83.8
2906326  North America            83.6

[2906327 rows x 2 columns]

In [10]:
df.describe()

              Month           Day          Year  AvgTemperature
count  2.906327e+06  2.906327e+06  2.906327e+06    2.906327e+06
mean   6.469163e+00  1.571682e+01  2.006624e+03    5.600492e+01
std    3.456489e+00  8.800534e+00  2.338226e+01    3.212359e+01
min    1.000000e+00  0.000000e+00  2.000000e+02   -9.900000e+01
25%    3.000000e+00  8.000000e+00  2.001000e+03    4.580000e+01
50%    6.000000e+00  1.600000e+01  2.007000e+03    6.250000e+01
75%    9.000000e+00  2.300000e+01  2.013000e+03    7.550000e+01
max    1.200000e+01  3.100000e+01  2.020000e+03    1.100000e+02

In [11]:
df.loc[df['AvgTemperature'].idxmax()]

Region            Middle East
Country                Kuwait
State                     NaN
City                   Kuwait
Month                       8
Day                         1
Year                     2012
AvgTemperature            110
Name: 1034962, dtype: object

In [12]:
df.Country.unique()

array(['Algeria', 'Burundi', 'Benin', 'Central African Republic', 'Congo',
       'Egypt', 'Ethiopia', 'Gabon', 'Gambia', 'Guinea', 'Guinea-Bissau',
       'Ivory Coast', 'Kenya', 'Morocco', 'Madagascar', 'Mauritania',
       'Malawi', 'Mozambique', 'Namibia', 'Nigeria', 'Senegal',
       'Sierra Leone', 'South Africa', 'Togo', 'Tunisia', 'Tanzania',
       'Uganda', 'Zambia', 'Bangladesh', 'China', 'Hong Kong', 'India',
       'Indonesia', 'Japan', 'Kazakhstan', 'Kyrgyzstan', 'Laos',
       'Malaysia', 'Mongolia', 'Myanmar (Burma)', 'Nepal', 'North Korea',
       'Pakistan', 'Philippines', 'Singapore', 'South Korea', 'Sri Lanka',
       'Taiwan', 'Tajikistan', 'Thailand', 'Turkmenistan', 'Uzbekistan',
       'Vietnam', 'Australia', 'New Zealand', 'Albania', 'Austria',
       'Belarus', 'Belgium', 'Bulgaria', 'Croatia', 'Cyprus',
       'Czech Republic', 'Denmark', 'Finland', 'France', 'Germany',
       'Georgia', 'Greece', 'Hungary', 'Iceland', 'Ireland', 'Italy',
       'Latvia', 'Macedonia', 'The Netherlands', 'Norway', 'Poland',
       'Portugal', 'Romania', 'Russia', 'Serbia-Montenegro', 'Slovakia',
       'Spain', 'Sweden', 'Switzerland', 'Ukraine', 'United Kingdom',
       'Yugoslavia', 'Bahrain', 'Israel', 'Jordan', 'Kuwait', 'Lebanon',
       'Oman', 'Qatar', 'Saudi Arabia', 'Syria', 'Turkey',
       'United Arab Emirates', 'Canada', 'Mexico', 'Argentina', 'Bahamas',
       'Bermuda', 'Belize', 'Bolivia', 'Barbados', 'Brazil', 'Colombia',
       'Costa Rica', 'Cuba', 'Dominican Republic', 'Equador', 'Guatemala',
       'Guyana', 'Haiti', 'Honduras', 'Nicaragua', 'Panama', 'Peru',
       'Suriname', 'Uruguay', 'Venezuela', 'US'], dtype=object)

In [16]:
df.groupby('Country').nunique()

            Region  Country  State  City  Month  Day  Year  AvgTemperature
Country
Albania          1        1      0     1     12   31    26             575
Algeria          1        1      0     1     12   31    26             493
Argentina        1        1      0     1     12   31    26             508
Australia        1        1      0     5     12   31    26             600
Austria          1        1      0     1     12   31    26             698
...            ...      ...    ...   ...    ...  ...   ...             ...
Uzbekistan       1        1      0     1     12   31    26             794
Venezuela        1        1      0     1     12   31    26             163
Vietnam          1        1      0     1     12   31    26             453
Yugoslavia       1        1      0     1     12   31    26             750
Zambia           1        1      0     1     12   31    20             396

[125 rows x 8 columns]